print("------------------------------------------------------快递成本计算器 by darboy------------------------------------------ ")
while(1):
    print("1.江浙沪皖文件 2.江浙沪皖物品 3.外围件文件 4.外围件文件（西藏） 5.北京 天津 广东等地 6.山西 陕西 重庆等地 7.云南 四川 广西等地 8.黑龙江 甘肃 9.内蒙古 青海 宁夏")
    area = input("请输入数字并回车(输入10即退出)，选择区域：")
    if area == '1':
        number_case = input("江浙沪皖文件 按0.2元/票算,输入票数：")
        print("总成本为：",(0.2 * float(number_case) + float(number_case) * 3.1),"元")
        print("---------------------------------------------------------------------------------------------------------------")
    elif area == '2':
        kg = input("江浙沪皖物品 按重量0.35元/kg,输入公斤数：")
        number_case = input("输入票数：")
        print("公斤数：", float(kg), "kg", "总成本为：", (0.35 * float(kg) + float(number_case) * 3.1), "元")
        print("---------------------------------------------------------------------------------------------------------------")
    elif area == '3':
        number_case = input("外围件文件 按1元/票算,输入票数：")
        print("总成本为：",(1 * float(number_case) + float(number_case) * 3.1),"元")
        print("---------------------------------------------------------------------------------------------------------------")
    elif area == '4':
        number_case = input("外围件文件（西藏） 按3元/票算,输入票数：")
        print("总成本为：", (3 * float(number_case) + float(number_case) * 3.1), "元")
        print("---------------------------------------------------------------------------------------------------------------")
    elif area == '5':
        kg = input("北京 天津 广东等地,输入公斤数：")
        number_case = input("输入票数：")
        if float(kg) < 3:
            if (float(kg) >= 0.1) & (float(kg) <= 0.3):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.1 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 0.31) & (float(kg) <= 0.5):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.2 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 0.51) & (float(kg) <= 1):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.5 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 1.01) & (float(kg) <= 1.5):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.9 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 1.51) & (float(kg) <= 3):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.1 * ((float(kg) - 1.51) / 10) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
        else:
            print("公斤数：", float(kg), "kg", "总成本为：", (1.3 * float(kg) + float(number_case) * 3.1), "元")
            print("---------------------------------------------------------------------------------------------------------------")
    elif area == '6':
        kg = input("山西 陕西 重庆等地,输入公斤数：")
        number_case = input("输入票数：")
        if float(kg) < 3:
            if (float(kg) >= 0.1) & (float(kg) <= 0.3):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.1 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 0.31) & (float(kg) <= 0.5):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.2 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 0.51) & (float(kg) <= 1):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.5 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 1.01) & (float(kg) <= 1.5):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.9 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 1.51) & (float(kg) <= 3):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.1 * ((float(kg) - 1.51) / 10) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
        else:
            print("公斤数：", float(kg), "kg", "总成本为：", (2.5 * float(kg) + float(number_case) * 3.1), "元")
            print("---------------------------------------------------------------------------------------------------------------")
    elif area == '7':
        kg = input("云南 四川 广西等地,输入公斤数：")
        number_case = input("输入票数：")
        if float(kg) < 3:
            if (float(kg) >= 0.1) & (float(kg) <= 0.3):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.1 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 0.31) & (float(kg) <= 0.5):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.2 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 0.51) & (float(kg) <= 1):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.5 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 1.01) & (float(kg) <= 1.5):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.9 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 1.51) & (float(kg) <= 3):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.1 * ((float(kg) - 1.51) / 10) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
        else:
            print("公斤数：", float(kg), "kg", "总成本为：", (3.4 * float(kg) + float(number_case) * 3.1), "元")
            print("---------------------------------------------------------------------------------------------------------------")
    elif area == '8':
        kg = input("黑龙江 甘肃,输入公斤数：")
        number_case = input("输入票数：")
        if float(kg) < 3:
            if (float(kg) >= 0.1) & (float(kg) <= 0.3):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.1 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 0.31) & (float(kg) <= 0.5):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.2 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 0.51) & (float(kg) <= 1):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.5 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 1.01) & (float(kg) <= 1.5):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.9 * float(number_case) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
            elif (float(kg) >= 1.51) & (float(kg) <= 3):
                print("公斤数：", float(kg), "kg", "总成本为：", (0.1 * ((float(kg) - 1.51) / 10) + float(number_case) * 3.1), "元")
                print("---------------------------------------------------------------------------------------------------------------")
        else:
            print("公斤数：", float(kg), "kg", "总成本为：", (4.2 * float(kg) + float(number_case) * 3.1), "元")
            print("---------------------------------------------------------------------------------------------------------------")
    elif area == '9':
        kg = input("青海 宁夏,输入公斤数：")
        number_case = input("输入票数：")
        print("公斤数：", float(kg), "kg", "总成本为：", (5 * float(kg) + float(number_case) * 3.1), "元")
        print("---------------------------------------------------------------------------------------------------------------")
    elif area == '10':
        break
